src/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ВалютыУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске.
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	ПРЕДСТАВЛЕНИЕ(КурсыВалютСрезПоследних.Валюта) КАК ПредставлениеВалюты,
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Кратность <> 0
	|			ТОГДА КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КурсКратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период,
	|	НЕ Валюта.ПометкаУдаления
	|	И Валюта <> &НациональнаяВалюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДатаСеанса()));
	
	ПодстрокиЗаголовка = Новый Массив;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.КурсКратность = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ПредставлениеКурса = Формат(Выборка.КурсКратность, "ЧДЦ=2");
		ПредставлениеКурсаВалюты = СтрШаблон("%1 %2", Выборка.ПредставлениеВалюты, ПредставлениеКурса);
		ПодстрокиЗаголовка.Добавить(ПредставлениеКурсаВалюты);
	КонецЦикла;
	
	Если ПодстрокиЗаголовка.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ЗаголовокКурсыВалют = СтрСоединить(ПодстрокиЗаголовка, " / ");
	Параметры.Вставить("ЗаголовокПриложенияВалютыУНФ", ЗаголовокКурсыВалют);
	
КонецПроцедуры

// Устарела. Будет удалена в следующей версии программы.
// Добавляет в конец заголовка приложения текущие курсы валют.
//
// Параметры:
//  ЗаголовокПриложения - Строка - текст заголовка приложения;
Процедура ДополнитьЗаголовокКлиентскогоПриложения(ЗаголовокПриложения) Экспорт

	Если ОбщегоНазначения.РазделениеВключено() И Не ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат;
	КонецЕсли;

	КомпонентыЗаголовка = Новый Массив;
	КомпонентыЗаголовка.Добавить(ЗаголовокПриложения);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 3
	|	ПРЕДСТАВЛЕНИЕ(КурсыВалютСрезПоследних.Валюта) КАК ПредставлениеВалюты,
	|	ВЫБОР
	|		КОГДА КурсыВалютСрезПоследних.Кратность <> 0
	|			ТОГДА КурсыВалютСрезПоследних.Курс / КурсыВалютСрезПоследних.Кратность
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КурсКратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период,
	|	НЕ Валюта.ПометкаУдаления
	|	И Валюта <> &НациональнаяВалюта) КАК КурсыВалютСрезПоследних";

	Запрос.УстановитьПараметр("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	Запрос.УстановитьПараметр("Период", НачалоДня(ТекущаяДатаСеанса()));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Если Выборка.КурсКратность = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		ПредставлениеКурсаВалюты = СтрШаблон("%1 %2", Выборка.ПредставлениеВалюты, Формат(Выборка.КурсКратность,
			"ЧДЦ=2"));
		КомпонентыЗаголовка.Добавить(ПредставлениеКурсаВалюты);

	КонецЦикла;

	ЗаголовокПриложения = СтрСоединить(КомпонентыЗаголовка, " / ");

КонецПроцедуры

#КонецОбласти
